package data

import model.Article
import model.Destination
import model.Paragraph

object FakeArticles {
    val destinations = listOf(
        Destination(
            id = 1,
            thumbnail = FakeImages.randomThumbnailUrl(),
            title = "Гора Бромо",
            description = "Активний вулкан і одна з найвідоміших природних пам'яток Індонезії. Відомий драматичними сходами сонця та місячними ландшафтами.",
            rating = 4.7f,
            location = "Східна Ява, Індонезія",
            price = "1300",
            type = "Вулкан",
            category = FakeCategories.categories[0],
            image = FakeImages.randomImageUrls(4),
            dates = listOf("Цілий рік"),
            meetingPoints = listOf("Вхід до гори Бромо"),
            facilities = listOf("Послуги гіда", "Паркінг", "Місцеві ресторани"),
            via = "Проболінгго",
            estimation = "2-3 години пішого маршруту",
            people = FakePeople.peoples[0],
        ),
        Destination(
            id = 2,
            thumbnail = FakeImages.randomThumbnailUrl(),
            title = "Семеру",
            description = "Найвища вершина на Яві, яка пропонує складні маршрути та захоплюючі краєвиди.",
            rating = 4.8f,
            location = "Східна Ява, Індонезія",
            price = "1900",
            type = "Вулкан",
            category = FakeCategories.categories[1],
            image = FakeImages.randomImageUrls(7),
            dates = listOf("Цілий рік"),
            meetingPoints = listOf("Село Тумпанг"),
            facilities = listOf("Місця для кемпінгу", "Послуги гіда"),
            via = "Тумпанг",
            estimation = "3-4 дні походу",
            people = FakePeople.peoples[0],
        ),
        Destination(
            id = 3,
            thumbnail = FakeImages.randomThumbnailUrl(),
            title = "Нуса-Пеніда",
            description = "Вражаючий острів, відомий своїми скелястими краєвидами та красивими пляжами, що пропонує спокійний відпочинок подалі від туристичних місць Балі.",
            rating = 4.5f,
            location = "Балі, Індонезія",
            price = "1100",
            type = "Острів",
            category = FakeCategories.categories[2],
            image = FakeImages.randomImageUrls(7),
            dates = listOf("Цілий рік"),
            meetingPoints = listOf("Гавань Санур"),
            facilities = listOf("Снаряддя для снорклінгу", "Місцеві гіди"),
            via = "Санур",
            estimation = "1 день для відвідування",
            people = FakePeople.peoples[0],
        ),
        Destination(
            id = 4,
            thumbnail = FakeImages.randomThumbnailUrl(),
            title = "Нуса-Лембонган",
            description = "Красивий острів, який пропонує можливості для снорклінгу та відпочинку в розслабленій атмосфері.",
            rating = 4.6f,
            location = "Балі, Індонезія",
            price = "1000",
            type = "Острів",
            category = FakeCategories.categories[3],
            image = FakeImages.randomImageUrls(5),
            dates = listOf("Цілий рік"),
            meetingPoints = listOf("Гавань Джунгут-Бату"),
            facilities = listOf("Снаряддя для снорклінгу", "Проживання біля пляжу"),
            via = "Санур",
            estimation = "2 дні перебування",
            people = FakePeople.peoples[0],
        ),
        Destination(
            id = 5,
            thumbnail = FakeImages.randomThumbnailUrl(),
            title = "Реабілітація орангутангів",
            description = "Центр охорони природи, присвячений реабілітації та збереженню орангутангів у Калімантані.",
            rating = 4.9f,
            location = "Калімантан, Індонезія",
            price = "800",
            type = "Природний заповідник",
            category = FakeCategories.categories[4],
            image = FakeImages.randomImageUrls(5),
            dates = listOf("Цілий рік"),
            meetingPoints = listOf("Пангалан Бун"),
            facilities = listOf("Екскурсії з гідом", "Освітні семінари"),
            via = "Пангалан Бун",
            estimation = "Від пів дня до цілого дня",
            people = FakePeople.peoples[0],
        ),
        Destination(
            id = 6,
            thumbnail = FakeImages.randomThumbnailUrl(),
            title = "Експедиції тропічними лісами",
            description = "Дослідження пишних тропічних лісів Калімантану з екскурсіями, що розкривають багате біорізноманіття регіону.",
            rating = 4.7f,
            location = "Калімантан, Індонезія",
            price = "600",
            type = "Тропічний ліс",
            category = FakeCategories.categories[3],
            image = FakeImages.randomImageUrls(10),
            dates = listOf("Цілий рік"),
            meetingPoints = listOf("Банджармасін"),
            facilities = listOf("Екскурсії з гідом", "Проживання"),
            via = "Банджармасін",
            estimation = "Від одного до кількох днів",
            people = FakePeople.peoples[0],
        )
    )

        val moreArticles = listOf(
            Article(
                id = "342446",
                title = "Пригоди чекають на Суматрі",
                subTitle = "Досліджуйте незайману красу Суматри",
                location = "Суматра, Індонезія",
                thumbnail = FakeImages.randomThumbnailUrl(),
                authorName = "Майкл",
                publishedDate = "12 березня 2024",
                type = "Стаття",
                description = "Суматра — це земля пригод і природної краси. Від густих джунглів до приголомшливих озер — відкрийте для себе найкращі активності на природі та захоплюючі пейзажі цього неймовірного острова. Завдяки своїм пишним тропічним лісам, високим вулканам і яскравим культурам Суматра пропонує широкий вибір вражень для любителів природи та шукачів пригод.",
                readAlso = null,
                paragraphs = listOf(
                    Paragraph(
                        title = "Озеро Тоба",
                        description = "Озеро Тоба — це величезне вулканічне озеро, оточене прекрасними краєвидами. Це ідеальне місце для відпочинку та знайомства з багатою культурою народу батаків.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    ),
                    Paragraph(
                        title = "Букит Лаванг",
                        description = "Букит Лаванг — це ворота до національного парку Гунунг Лейзер, відомого своїми зусиллями зі збереження орангутангів.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    )
                ),
                moreArticles = listOf()
            ),
            Article(
                id = "342447",
                title = "Чудеса острова Комодо",
                subTitle = "Відкрийте унікальну флору та фауну Комодо",
                location = "Острів Комодо, Індонезія",
                thumbnail = FakeImages.randomThumbnailUrl(),
                authorName = "Емма",
                publishedDate = "25 березня 2024",
                type = "Стаття",
                readAlso = null,
                description = "Острів Комодо є домом для знаменитих комодських варанів і пропонує одні з найприголомшливіших підводних пригод в Індонезії.",
                paragraphs = listOf(
                    Paragraph(
                        title = "Комодські варани",
                        description = "Познайомтеся з комодськими варанами — найбільшими ящірками у світі, у їхньому природному середовищі.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    ),
                    Paragraph(
                        title = "Снорклінг та дайвінг",
                        description = "Води навколо острова Комодо ідеально підходять для снорклінгу та дайвінгу.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    )
                ),
                moreArticles = listOf()
            ),
            Article(
                id = "342448",
                title = "Вивчаючи серце Калімантану",
                subTitle = "Подорож до природних чудес Калімантану",
                location = "Калімантан, Індонезія",
                thumbnail = FakeImages.randomThumbnailUrl(),
                authorName = "Олівія",
                publishedDate = "30 квітня 2024",
                type = "Стаття",
                readAlso = null,
                description = "Калімантан, індонезійська частина Борнео, пропонує багатство природних чудес і вражень від дикої природи.",
                paragraphs = listOf(
                    Paragraph(
                        title = "Національний парк Танджунг Путінг",
                        description = "Танджунг Путінг відомий своїм центром реабілітації орангутангів і незайманим тропічним лісом.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    ),
                    Paragraph(
                        title = "Плавучий ринок Банджармасін",
                        description = "Відвідайте яскраві плавучі ринки Банджармасіна, де місцеві торгівці продають свіжі продукти зі своїх човнів.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    )
                ),
                moreArticles = listOf()
            ),
            Article(
                id = "342449",
                title = "Розкриваючи таємниці Флореса",
                subTitle = "Досліджуйте різноманітні ландшафти та культури Флореса",
                location = "Флорес, Індонезія",
                thumbnail = FakeImages.randomThumbnailUrl(),
                authorName = "Софія",
                publishedDate = "10 травня 2024",
                type = "Стаття",
                readAlso = null,
                description = "Флорес пропонує суміш унікальних ландшафтів і багатих культурних вражень.",
                paragraphs = listOf(
                    Paragraph(
                        title = "Вулкан Келімуту",
                        description = "Вулкан Келімуту славиться своїми трьома кольоровими кратерними озерами.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    ),
                    Paragraph(
                        title = "Традиційні села",
                        description = "Досліджуйте традиційні села Флореса, де можна дізнатися про місцеві звичаї та ремесла.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    )
                ),
                moreArticles = listOf()
            ),
            Article(
                id = "342450",
                title = "Зачарування прихованих храмів Яви",
                subTitle = "Відкрийте маловідомі храми та історичні місця Яви",
                location = "Ява, Індонезія",
                thumbnail = FakeImages.randomThumbnailUrl(),
                authorName = "Ліам",
                publishedDate = "20 червня 2024",
                type = "Стаття",
                readAlso = null,
                description = "Ява є домом для багатьох дивовижних храмів, які варто відкрити для себе.",
                paragraphs = listOf(
                    Paragraph(
                        title = "Храм Чанді Чето",
                        description = "Чанді Чето — це маловідомий храм із прекрасним видом на гори.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    ),
                    Paragraph(
                        title = "Храм Чанді Сукух",
                        description = "Чанді Сукух відомий своєю унікальною пірамідальною формою та тонкими різьбленнями.",
                        image = FakeImages.randomImageUrl(),
                        destination = null
                    )
                ),
                moreArticles = listOf()
            )
        )

    val articles = listOf(
        Article(
            id = "342432",
            title = "Ось вони, Сім вершин Східної Яви!",
            subTitle = "Відкрийте величні вершини Східної Яви",
            location = "Східна Ява, Індонезія",
            thumbnail = FakeImages.randomThumbnailUrl(),
            authorName = "Адам",
            publishedDate = "8 грудня 2022",
            type = "Стаття",
            description = "Східна Ява, чарівна провінція в Індонезії, відома своїми вражаючими горами, відомими як Сім вершин. Серед них найвищою є гора Семеру, висота якої сягає 3,676 метрів. Цей величний вулкан є не лише найвищим, але й важливою пам'яткою національного парку Бромо-Тенгер-Семеру. Підйом на Семеру дарує приголомшливі види та незабутній досвід. Ще одна з вершин, Раунг, висотою 3,332 метри, відома своїм скелястим рельєфом та активністю вулкану, що приваблює шукачів пригод. Гора Арджуно, висотою 3,339 метрів, пропонує кілька маршрутів, зокрема популярні з Лаванга та Третеса. Гора Бутак, трохи нижча, з висотою 2,868 метрів, відома своєю живописною красою та відносно легкими пішохідними маршрутами. І нарешті, гора Веліранг, висотою 3,156 метрів, славиться своїми сірчаними відкладеннями та унікальними геологічними особливостями. Дослідження цих вершин не лише дарує фізичні випробування, але й глибоке сприйняття природної краси та культурного значення Східної Яви.",
            readAlso = null,
            paragraphs = arrayListOf(
                Paragraph(
                    title = "Гора Семеру (3676 м над рівнем моря)",
                    description = "Гора Семеру — найвища гора Східної Яви з висотою 3,676 метрів над рівнем моря. Пік називається Махамеру, а кратер — Джонгринг Салоко. Вона має кілька маршрутів для сходження та є частиною національного парку Бромо-Тенгер-Семеру. Сходження є складним, але винагороджує захоплюючими видами навколишніх ландшафтів та вулканічного рельєфу. Це популярне місце для досвідчених альпіністів та любителів природи. Сам парк славиться своєю багатою біорізноманітністю, з численними видами флори та фауни. Під час сходження ви зустрінете різноманітні екосистеми, від тропічних лісів до альпійських лугів. На вершині відкривається панорамний вид, який зачаровує, особливо на сході сонця. Сходження на Семеру — це пригода, що поєднує фізичні випробування з природною красою.",
                    image = FakeImages.randomImageUrl(), destination = destinations[0]
                ),
                Paragraph(
                    title = "Гора Раунг (3332 м над рівнем моря)",
                    description = "Гора Раунг — активний вулкан висотою 3,332 метра. Вона має складний рельєф і пропонує складний досвід сходження. Підйом є вимогливим через круті схили та вулканічні породи. На вершині відкривається унікальний вигляд на навколишній ландшафт, включаючи інші вулканічні вершини та зелені долини. Активність вулкана також можна спостерігати з безпечної відстані, що додає адреналіну під час сходження. Гора Раунг, зі своєю скелястою красою та активністю, є чудовим місцем для шукачів пригод. Підйом вимагає належної підготовки та акліматизації через висоту та суворі умови. Незважаючи на труднощі, види з вершини неймовірно винагороджують, даруючи відчуття досягнення та зв'язку з природою.",
                    image = FakeImages.randomImageUrl(), destination = destinations[1]
                ),
                Paragraph(
                    title = "Гора Арджуно (3339 м над рівнем моря)",
                    description = "Гора Арджуно, висотою 3,339 метрів, є однією з відомих вершин Східної Яви. Гора пропонує кілька маршрутів, кожен з яких дарує унікальний досвід. Популярними є маршрути з Лаванга та Третеса, які підходять для різних рівнів досвіду. Підйом через пишні ліси та кам'янисті стежки веде до чудових точок огляду, де альпіністи можуть оцінити природну красу регіону. Вершина Арджуно відкриває панорамний вигляд на навколишні гори та долини, що робить її чудовим місцем для пішохідних подорожей та любителів природи. Різноманітні екосистеми, з якими зустрічаються під час сходження, додають до загального досвіду, показуючи багатство біорізноманіття Східної Яви.",
                    image = FakeImages.randomImageUrl(), destination = destinations[2]
                ),
                Paragraph(
                    title = "Гора Бутак (2868 м над рівнем моря)",
                    description = "Гора Бутак, висотою 2,868 метрів, пропонує інший досвід порівняно з вищими вершинами Східної Яви. Вона відома своїми відносно легкими пішохідними маршрутами, що робить її доступною для широкого кола мандрівників. Гора дарує живописні види на навколишні території і є чудовим місцем для тих, хто хоче насолодитися менш виснажливим підйомом. Стежки проходять через зелені ліси та відкриті луки, даруючи мирний відпочинок від складніших сходжень. Вершина відкриває панорамний вигляд на ландшафт Східної Яви, включаючи інші гори та вулканічні утворення. Гора Бутак є ідеальним місцем для денних походів і є чудовим введенням до краси гірського ландшафту Східної Яви.",
                    image = FakeImages.randomImageUrl(), destination = null
                ),
                Paragraph(
                    title = "Гора Веліранг (3156 м над рівнем моря)",
                    description = "Гора Веліранг, висотою 3,156 метрів, відома своїми сірчаними відкладеннями та вулканічною активністю. Унікальні геологічні особливості гори включають фумароли та сірчані вентилі, що створюють захоплюючий ландшафт для відвідувачів. Підйом до вершини передбачає подолання складного рельєфу та вулканічних порід, що робить його більш вимогливим. Проте, види та можливість спостерігати вулканічні явища роблять його вартий зусиль. Навколишня територія багата біорізноманіттям, з різними видами рослин і тварин, що адаптувалися до вулканічного середовища. Підйом пропонує погляд на динамічні процеси, що формують поверхню Землі. Веліранг є важливою вершиною вулканічного ландшафту Східної Яви, поєднуючи природну красу з геологічною цікавинкою.",
                    image = FakeImages.randomImageUrl(), destination = destinations[4]
                )
            ),
            moreArticles = moreArticles
        ),
        Article(
            id = "342433",
            title = "Стародавні храми Джок'якарти",
            subTitle = "Вивчення історичних чудес Центральної Яви",
            location = "Джок'якарта, Індонезія",
            thumbnail = FakeImages.randomThumbnailUrl(),
            authorName = "Ліза",
            publishedDate = "15 січня 2023",
            type = "Стаття",
            description = "Джок'якарта, місто з багатою історією та культурою, є домівкою для деяких з найважливіших стародавніх храмів Індонезії. Храм Боробудур, об'єкт Всесвітньої спадщини ЮНЕСКО, відомий своїм велетенським ступою та складними рельєфними панелями. Він символізує шлях до просвітлення в буддійській традиції, а його дизайн представляє різні етапи духовного шляху. Комплекс храмів Прамбанан, ще один об'єкт ЮНЕСКО, вражає своїми індуїстськими храмами, присвяченими Трімурті — Брахмі, Вішну та Шиві. Ці храми прикрашені витонченими різьбленими сценами з індуїстських епосів і є свідченням стародавнього яванського ремесла. Відвідування цих храмів дає глибоке розуміння духовної та культурної спадщини регіону.",
            readAlso = null,
            paragraphs = arrayListOf(
                Paragraph(
                    title = "Храм Боробудур",
                    description = "Храм Боробудур, розташований у Центральній Яві, є величною буддійською пам'яткою, відомою своїм великим ступою та складними різьбленнями. Храм побудований у вигляді терас і містить понад 500 статуй Будди в різних позах. Його дизайн символізує подорож до просвітлення, причому кожен рівень представляє різний етап буддійського вчення. Панорамний вид із храму охоплює пишні яванські пейзажі та знаковий вулкан Мерапі вдалині. Відвідувачів зачаровує спокійна атмосфера та детальні роботи, що робить Боробудур важливим місцем для всіх, хто цікавиться історичними та духовними подорожами.",
                    image = FakeImages.randomImageUrl(), destination = destinations[2]
                ),
                Paragraph(
                    title = "Храм Прамбанан",
                    description = "Храм Прамбанан, також відомий як Чанді Прамбанан, є знаковим індуїстським храмовим комплексом, який демонструє художні та архітектурні досягнення стародавньої Яви. Храм присвячений Трімурті — трьом верховним індуїстським богам: Брахмі, Вішну та Шиві. Центральна споруда, присвячена Шиві, сягає 47 метрів у висоту і оточена меншими храмами, присвяченими Брахмі та Вішну. Складні різьблення на стінах храму зображують сцени з індуїстських епосів, таких як Рамаяна та Махабхарата. Комплекс Прамбанан відкриває захоплюючий погляд на індуїстську міфологію та стародавнє ремесло. Історична значущість та архітектурна велич роблять це місце важливим для відвідувачів, які досліджують культурну спадщину Джок'якарти.",
                    image = FakeImages.randomImageUrl(), destination = destinations[3]
                )
            ),
            moreArticles = moreArticles
        ),
        Article(
            id = "342434",
            title = "Комодські дракони: гіганти світу рептилій",
            subTitle = "Ближчий погляд на найбільших ящірок у світі",
            location = "Острів Комодо, Індонезія",
            thumbnail = FakeImages.randomThumbnailUrl(),
            authorName = "Девід",
            publishedDate = "20 лютого 2023",
            type = "Стаття",
            description = "Острів Комодо, частина індонезійського архіпелагу, відомий як природне середовище проживання комодських драконів — найбільших живих ящірок на Землі. Ці грізні рептилії можуть досягати до 3 метрів у довжину та важити до 70 кілограмів. Їхня потужна будова та звички падальників роблять їх головними хижаками у їхньому середовищі. Комодські дракони переважно харчуються великою здобиччю, включаючи оленів і диких кабанів, а їхні вражаючі мисливські навички доповнюються гострим нюхом. Унікальна екосистема острова підтримує різноманіття дикої природи, а дракони відіграють ключову роль у збереженні екологічного балансу. Відвідування острова Комодо дає можливість спостерігати за цими незвичайними істотами зблизька, а також досліджувати мальовничі пейзажі та незаймані пляжі. Організовані тури дозволяють безпечно оцінити природну поведінку драконів і дізнатися про зусилля зі збереження цих неймовірних тварин.",
            readAlso = null,
            paragraphs = arrayListOf(
                Paragraph(
                    title = "Середовище проживання комодських драконів",
                    description = "Комодські дракони мешкають на кількох островах Індонезії, включаючи острів Комодо, Рінка та кілька менших островів у Національному парку Комодо. Ці ящірки процвітають у різноманітних середовищах, від сухих саван до тропічних лісів. Їхня адаптація до таких умов зробила їх стійкими та грізними хижаками. Унікальна геологія та клімат цих островів сприяють виживанню комодських драконів, забезпечуючи їх достатньою кількістю їжі та сприятливими умовами для проживання.",
                    image = FakeImages.randomImageUrl(), destination = destinations[5]
                ),
                Paragraph(
                    title = "Екскурсії з гідами",
                    description = "Щоб повною мірою оцінити острів Комодо та безпечно спостерігати за комодськими драконами, рекомендуються екскурсії з гідами. Ці екскурсії проводять досвідчені місцеві гіди, які знають про поведінку драконів, екологію острова та заходи зі збереження. Гіди забезпечують дотримання протоколів безпеки, одночасно надаючи освітню інформацію про життя цих величних рептилій.",
                    image = FakeImages.randomImageUrl(), destination = destinations[2]
                )
            ),
            moreArticles = moreArticles
        ),
        Article(
            id = "342435",
            title = "Магічні комодські дракони",
            subTitle = "Зустріч із найбільшою ящіркою світу",
            location = "Острів Комодо, Індонезія",
            thumbnail = FakeImages.randomThumbnailUrl(),
            authorName = "Джон",
            publishedDate = "5 березня 2023",
            type = "Стаття",
            description = "Острів Комодо — це домівка знаменитих комодських драконів, найбільших ящірок у світі. Відвідування цього острова пропонує незабутній досвід спостереження за дикою природою.",
            readAlso = null,
            paragraphs = arrayListOf(
                Paragraph(
                    title = "Середовище проживання комодських драконів",
                    description = "Комодські дракони природно мешкають на острові Комодо, Рінка та кількох інших менших островах. Вони відомі своїми розмірами, силою та унікальним виглядом.",
                    image = FakeImages.randomImageUrl(),
                    destination = destinations[5]
                ),
                Paragraph(
                    title = "Екскурсії з гідами",
                    description = "Досліджуйте острів Комодо за допомогою екскурсій із гідами, щоб безпечно спостерігати за цими велетнями-рептиліями та дізнатися про їхню поведінку та заходи зі збереження.",
                    image = FakeImages.randomImageUrl(),
                    destination = destinations[0]
                )
            ),
            moreArticles = moreArticles
        ),
    )
}

